<template>
  <div class="page">
    <h1 class="h1">Методики проведения качественных реакций</h1>
    <div class="reaction-card">
      <h2 class="h2">Реакция азотосочетания</h2>
      <p>
        <b>Реактивы:</b> Хлорид бензолдиазония (C<sub>6</sub>H<sub>5</sub>N<sub>2</sub>Cl). Раствор
        карбоната натрия (Na<sub>2</sub>CO<sub>3</sub>). Исследуемый раствор.
      </p>
      <p>
        <b>Методика проведения:</b> К 1-2 мл раствора хлорида бензолдиазония добавляют каплю
        раствора фенола. Затем добавляют 1–2 мл раствора карбоната натрия для создания слабощелочной
        среды, необходимой для образования фенолят-иона.
      </p>
      <p>
        <b>Результат реакции:</b> Происходит реакция электрофильного замещения, жидкость
        окрашивается в интенсивный вишнёво-красный цвет из-за образования красителя
        п-оксиазобензола.
      </p>
    </div>
    <div class="reaction-card">
      <h2 class="h2">Биуретовая реакция</h2>
      <p>
        <b>Реактивы:</b> Раствор гидроксида натрия (NaOH) или калия (KOH). Раствор сульфата меди
        (II) (CuSO<sub>4</sub>). Исследуемый раствор.
      </p>
      <p>
        <b>Методика проведения:</b> В пробирку налейте 1 мл исследуемого раствора. Добавьте 1 мл 10%
        раствора щелочи и перемешайте. По каплям (около 5–8 капель) добавьте раствор сульфата меди,
        постоянно встряхивая пробирку.
      </p>
      <p>
        <b>Результат реакции:</b> Жидкость окрашивается в розово-фиолетовый или сине-фиолетовый
        цвет. Оттенок зависит от длины белковой цепи и количества пептидных связей.
      </p>
    </div>
    <div class="reaction-card">
      <h2 class="h2">Реакция с дихроматом калия</h2>
      <p>
        <b>Реактивы:</b> Соляная кислота (HCl). Раствор дихроматом калия
        (K<sub>2</sub>Cr<sub>2</sub>O<sub>7</sub>). Исследуемый раствор.
      </p>
      <p>
        <b>Методика проведения:</b> Поместите в пробирку небольшое количество измельченного
        препарата (на кончике шпателя). Прибавьте 2 – 3 мл 10 % раствора соляной кислоты и
        прокипятите смесь на слабом огне в течение 1 – 2 минут. В ходе гидролиза амидная связь
        разрывается с образованием свободного n-аминофенола. Охладите пробирку под струей холодной
        воды. По каплям добавьте 2 – 3 капли 1 % раствора дихромата калия.
      </p>
      <p>
        <b>Результат реакции:</b> При взаимодействии продуктов окисления происходит образование
        индофенолового красителя с характерной фиолетовой окраской.
      </p>
    </div>

    <div class="reaction-card">
      <h2 class="h2">Нингидриновая реакция</h2>
      <p>
        <b>Реактивы:</b> Раствор нингидрина (C<sub>9</sub>H<sub>6</sub>О<sub>4</sub>). Исследуемый
        раствор.
      </p>
      <p>
        <b>Методика проведения:</b> К 1 мл нейтрального исследуемого раствора добавьте 2–3 капли
        свежеприготовленного раствора нингидрина (0,1–0,2% раствор в дистиллированной воде или
        этиловом спирте). Тщательно перемешайте смесь и пробипятите её на водяной бане в течение 1–3
        минут.
      </p>
      <p>
        <b>Результат реакции:</b> Появление сине-фиолетовой или пурпурной окраски указывает на
        присутствие свободных аминокислот (или белков/пептидов, содержащих свободные аминогруппы).
        Вторичные аминокислоты (например, пролин и гидроксипролин) дадут желтое окрашивание.
      </p>
    </div>

    <div class="reaction-card">
      <h2 class="h2">Реакция с хлоридом железа</h2>
      <p><b>Реактивы:</b> Раствор хлорида железа (III) (FeCl<sub>3</sub>). Исследуемый раствор.</p>
      <p>
        <b>Методика проведения:</b>Налейте в пробирку 1 мл исследуемого водного раствора фенола.
        Добавьте 1–2 капли свежеприготовленного слабого раствора хлорида железа (III)
        (FeCl/<sub>3</sub>). Для ускорения реакции подогрейте пробирку.
      </p>
      <p><b>Результат реакции:</b> Жидкость окрашивается в интенсивный фиолетовый цвет.</p>
    </div>
  </div>
</template>

<style scoped>
h1 {
  margin-top: 2px;
  font-size: 20px;
  margin-bottom: 15px;
}
h2 {
  font-size: 20px;
  margin-bottom: 10px;
  font-weight: bold;
}
p {
  font-size: 18px;
  margin-bottom: 5px;
}
.reaction-card {
  border: 1px solid rgb(212, 211, 211);
  border-radius: 10px;

  margin-bottom: 25px;
  padding: 20px;
}

@media (max-width: 450px) {
  .page {
    padding: 15px;
    margin: 10px;
  }

  .h1 {
    font-size: 20px !important;
    font-weight: bold;
    margin-bottom: 15px;
    text-align: center;
  }

  .h2 {
    font-size: 18px !important;
  }

  p {
    font-size: 16px !important;
  }
  button {
    padding: 4px 10px;
    font-size: 16px;
  }
}
</style>
